#pragma once

#include "../../framework.h"
#include "../game.sdk.h"

#define POINTER_PLAYER 0x715B9C

enum PLAYER_STATE
{ 
	PLAYER_INVALID = -1,
	PLAYER_MENU = 0,
	PLAYER_CUTSCENE = 1,
	PLAYER_INGAME = 2
};

enum CAMERA_MODE
{
	CAMERA_MODE_INVALID = -1,
	CAMERA_MODE_FLYMODE = 0,
	CAMERA_MODE_FIRST_PERSON = 1,
	CAMERA_MODE_THIRD_PERSON = 2
};

typedef int(__thiscall* tForcedAnim)(void* pThis, void*, char* anim);

#ifndef C_PLAYER_H
#define C_PLAYER_H
    extern tForcedAnim oForcedPlayAnim;
    extern SafetyHookInline g_ForcedPlayAnimHook;
#endif

int __fastcall hkForcedPlayAnim(void* pThis,
    void*,
    char* anim);

//

#pragma pack(push, 1)

/*

DWORD pPlayerAddr = *(DWORD*)0x715B9C;
Player* pPlayer = (Player*)pPlayerAddr;

*/

struct Player
{
    // 0x00
    void* pVTable;                           // 0x00
    DWORD dwFlags;                           // 0x04
    DWORD dwUnknown08;                       // 0x08
    DWORD dwUnknown0C;                       // 0x0C
    DWORD dwUnknown10;                       // 0x10
    float fHealth;                           // 0x14 (saúde do jogador)
    DWORD dwUnknown18;                       // 0x18
    float fUnknown1C;                        // 0x1C
    float fUnknown20;                        // 0x20
    float fUnknown24;                        // 0x24
    float fUnknown28;                        // 0x28
    DWORD dwUnknown2C;                       // 0x2C
    DWORD dwUnknown30;                       // 0x30
    double dUnknown34;                       // 0x34
    DWORD dwUnknown3C;                       // 0x3C
    DWORD dwUnknown40;                       // 0x40
    DWORD dwUnknown44;                       // 0x44
    DWORD dwUnknown48;                       // 0x48
    DWORD dwUnknown4C;                       // 0x4C
    DWORD dwUnknown50;                       // 0x50
    DWORD dwUnknown54;                       // 0x54
    DWORD dwUnknown58;                       // 0x58
    DWORD dwUnknown5C;                       // 0x5C
    DWORD dwUnknown60;                       // 0x60
    DWORD dwUnknown64;                       // 0x64
    DWORD dwUnknown68;                       // 0x68
    DWORD dwUnknown6C;                       // 0x6C
    void* pUnknown70;                        // 0x70
    DWORD dwUnknown74;                       // 0x74
    void* pUnknown78;                        // 0x78
    void* pUnknown7C;                        // 0x7C
    void* pUnknown80;                        // 0x80
    void* pUnknown84;                        // 0x84
    DWORD dwUnknown88;                       // 0x88
    void* pUnknown8C;                        // 0x8C
    void* pUnknown90;                        // 0x90
    DWORD dwUnknown94;                       // 0x94
    DWORD dwUnknown98;                       // 0x98
    void* pUnknown9C;                        // 0x9C
    void* pUnknownA0;                        // 0xA0
    DWORD dwUnknownA4;                       // 0xA4
    void* pUnknownA8;                        // 0xA8
    void* pUnknownAC;                        // 0xAC
    DWORD dwUnknownB0;                       // 0xB0
    DWORD dwUnknownB4;                       // 0xB4
    DWORD dwUnknownB8;                       // 0xB8
    void* pUnknownBC;                        // 0xBC
    DWORD dwUnknownC0;                       // 0xC0
    DWORD dwUnknownC4;                       // 0xC4
    DWORD dwUnknownC8;                       // 0xC8
    float fUnknownCC;                        // 0xCC
    float fUnknownD0;                        // 0xD0
    float fUnknownD4;                        // 0xD4
    float fUnknownD8;                        // 0xD8
    DWORD dwUnknownDC;                       // 0xDC
    DWORD dwUnknownE0;                       // 0xE0
    DWORD dwUnknownE4;                       // 0xE4
    DWORD dwUnknownE8;                       // 0xE8
    DWORD dwUnknownEC;                       // 0xEC
    DWORD dwUnknownF0;                       // 0xF0
    DWORD dwUnknownF4;                       // 0xF4
    DWORD dwUnknownF8;                       // 0xF8
    DWORD dwUnknownFC;                       // 0xFC
    DWORD dwUnknown100;                      // 0x100
    DWORD dwUnknown104;                      // 0x104
    DWORD dwUnknown108;                      // 0x108
    DWORD dwUnknown10C;                      // 0x10C
    DWORD dwUnknown110;                      // 0x110
    DWORD dwUnknown114;                      // 0x114
    DWORD dwUnknown118;                      // 0x118
    DWORD dwUnknown11C;                      // 0x11C
    DWORD dwUnknown120;                      // 0x120
    DWORD dwUnknown124;                      // 0x124
    DWORD dwUnknown128;                      // 0x128
    DWORD dwUnknown12C;                      // 0x12C
    DWORD dwUnknown130;                      // 0x130
    DWORD dwUnknown134;                      // 0x134
    DWORD dwUnknown138;                      // 0x138
    DWORD dwUnknown13C;                      // 0x13C
    DWORD dwUnknown140;                      // 0x140
    DWORD dwUnknown144;                      // 0x144
    DWORD dwUnknown148;                      // 0x148
    DWORD dwUnknown14C;                      // 0x14C
    void* pUnknown150;                       // 0x150
    DWORD dwUnknown154;                      // 0x154
    DWORD dwUnknown158;                      // 0x158
    DWORD dwUnknown15C;                      // 0x15C
    DWORD dwUnknown160;                      // 0x160
    DWORD dwUnknown164;                      // 0x164
    DWORD dwUnknown168;                      // 0x168
    float fUnknown16C;                       // 0x16C
    DWORD dwUnknown170;                      // 0x170
    float fUnknown174;                       // 0x174
    DWORD dwUnknown178;                      // 0x178
    DWORD dwUnknown17C;                      // 0x17C
    float fUnknown180;                       // 0x180
    float fUnknown184;                       // 0x184
    float fUnknown188;                       // 0x188
    float fUnknown18C;                       // 0x18C
    DWORD dwUnknown190;                      // 0x190
    DWORD dwUnknown194;                      // 0x194
    DWORD dwUnknown198;                      // 0x198
    void* pUnknown19C;                       // 0x19C
    DWORD dwUnknown1A0;                      // 0x1A0
    DWORD dwUnknown1A4;                      // 0x1A4
    DWORD dwUnknown1A8;                      // 0x1A8
    DWORD dwUnknown1AC;                      // 0x1AC
    DWORD dwUnknown1B0;                      // 0x1B0
    DWORD dwUnknown1B4;                      // 0x1B4
    DWORD dwUnknown1B8;                      // 0x1B8
    DWORD dwUnknown1BC;                      // 0x1BC
    DWORD dwUnknown1C0;                      // 0x1C0
    DWORD dwUnknown1C4;                      // 0x1C4
    DWORD dwUnknown1C8;                      // 0x1C8
    void* pUnknown1CC;                       // 0x1CC
    DWORD dwUnknown1D0;                      // 0x1D0
    DWORD dwUnknown1D4;                      // 0x1D4
    DWORD dwUnknown1D8;                      // 0x1D8
    DWORD dwUnknown1DC;                      // 0x1DC
    DWORD dwUnknown1E0;                      // 0x1E0
    DWORD dwUnknown1E4;                      // 0x1E4
    DWORD dwUnknown1E8;                      // 0x1E8
    DWORD dwUnknown1EC;                      // 0x1EC
    DWORD dwUnknown1F0;                      // 0x1F0
    DWORD dwUnknown1F4;                      // 0x1F4
    DWORD dwUnknown1F8;                      // 0x1F8
    DWORD dwUnknown1FC;                      // 0x1FC
    DWORD dwUnknown200;                      // 0x200
    DWORD dwUnknown204;                      // 0x204
    DWORD dwUnknown208;                      // 0x208
    DWORD dwUnknown20C;                      // 0x20C
    DWORD dwUnknown210;                      // 0x210
    DWORD dwUnknown214;                      // 0x214
    DWORD dwUnknown218;                      // 0x218
    DWORD dwUnknown21C;                      // 0x21C
    DWORD dwUnknown220;                      // 0x220
    DWORD dwUnknown224;                      // 0x224
    DWORD dwUnknown228;                      // 0x228
    DWORD dwUnknown22C;                      // 0x22C
    DWORD dwUnknown230;                      // 0x230
    DWORD dwUnknown234;                      // 0x234
    DWORD dwUnknown238;                      // 0x238
    DWORD dwUnknown23C;                      // 0x23C
    DWORD dwUnknown240;                      // 0x240
    DWORD dwUnknown244;                      // 0x244
    DWORD dwUnknown248;                      // 0x248
    DWORD dwUnknown24C;                      // 0x24C
    DWORD dwUnknown250;                      // 0x250
    DWORD dwUnknown254;                      // 0x254
    DWORD dwUnknown258;                      // 0x258
    DWORD dwUnknown25C;                      // 0x25C
    DWORD dwUnknown260;                      // 0x260
    DWORD dwUnknown264;                      // 0x264
    DWORD dwUnknown268;                      // 0x268
    DWORD dwUnknown26C;                      // 0x26C
    DWORD dwUnknown270;                      // 0x270
    DWORD dwUnknown274;                      // 0x274
    DWORD dwUnknown278;                      // 0x278
    DWORD dwUnknown27C;                      // 0x27C
    DWORD dwUnknown280;                      // 0x280
    DWORD dwUnknown284;                      // 0x284
    DWORD dwUnknown288;                      // 0x288
    DWORD dwUnknown28C;                      // 0x28C
    DWORD dwUnknown290;                      // 0x290
    DWORD dwUnknown294;                      // 0x294
    DWORD dwUnknown298;                      // 0x298
    DWORD dwUnknown29C;                      // 0x29C
    DWORD dwUnknown2A0;                      // 0x2A0
    DWORD dwUnknown2A4;                      // 0x2A4
    DWORD dwUnknown2A8;                      // 0x2A8
    DWORD dwUnknown2AC;                      // 0x2AC
    DWORD dwUnknown2B0;                      // 0x2B0
    DWORD dwUnknown2B4;                      // 0x2B4
    DWORD dwUnknown2B8;                      // 0x2B8
    DWORD dwUnknown2BC;                      // 0x2BC
    DWORD dwUnknown2C0;                      // 0x2C0
    DWORD dwUnknown2C4;                      // 0x2C4
    DWORD dwUnknown2C8;                      // 0x2C8
    DWORD dwUnknown2CC;                      // 0x2CC
    DWORD dwUnknown2D0;                      // 0x2D0
    float fUnknown2D4;                       // 0x2D4
    float fUnknown2D8;                       // 0x2D8
    float fUnknown2DC;                       // 0x2DC
    DWORD dwUnknown2E0;                      // 0x2E0
    DWORD dwUnknown2E4;                      // 0x2E4
    DWORD dwUnknown2E8;                      // 0x2E8
    DWORD dwUnknown2EC;                      // 0x2EC
    DWORD dwUnknown2F0;                      // 0x2F0
    void* pUnknown2F4;                       // 0x2F4
    void* pUnknown2F8;                       // 0x2F8
    void* pUnknown2FC;                       // 0x2FC
    DWORD dwUnknown300;                      // 0x300
    DWORD dwUnknown304;                      // 0x304
    void* pUnknown308;                       // 0x308
    DWORD dwUnknown30C;                      // 0x30C
    void* pUnknown310;                       // 0x310
    void* pUnknown314;                       // 0x314
    void* pUnknown318;                       // 0x318
    void* pUnknown31C;                       // 0x31C
    void* pUnknown320;                       // 0x320
    void* pUnknown324;                       // 0x324
    void* pUnknown328;                       // 0x328
    void* pUnknown32C;                       // 0x32C
    void* pUnknown330;                       // 0x330
    void* pUnknown334;                       // 0x334
    DWORD dwUnknown338;                      // 0x338
    DWORD dwUnknown33C;                      // 0x33C
    DWORD dwUnknown340;                      // 0x340
    float fUnknown344;                       // 0x344
    DWORD dwUnknown348;                      // 0x348
    DWORD dwUnknown34C;                      // 0x34C
    DWORD dwUnknown350;                      // 0x350
    DWORD dwUnknown354;                      // 0x354
    DWORD dwUnknown358;                      // 0x358
    DWORD dwUnknown35C;                      // 0x35C
    DWORD dwUnknown360;                      // 0x360
    DWORD dwUnknown364;                      // 0x364
    DWORD dwUnknown368;                      // 0x368
    DWORD dwUnknown36C;                      // 0x36C
    DWORD dwUnknown370;                      // 0x370
    DWORD dwUnknown374;                      // 0x374
    DWORD dwUnknown378;                      // 0x378
    DWORD dwUnknown37C;                      // 0x37C
    DWORD dwUnknown380;                      // 0x380
    DWORD dwUnknown384;                      // 0x384
    DWORD dwUnknown388;                      // 0x388
    DWORD dwUnknown38C;                      // 0x38C
    DWORD dwUnknown390;                      // 0x390
    DWORD dwUnknown394;                      // 0x394
    DWORD dwUnknown398;                      // 0x398
    DWORD dwUnknown39C;                      // 0x39C
    DWORD dwUnknown3A0;                      // 0x3A0
    DWORD dwUnknown3A4;                      // 0x3A4
    DWORD dwUnknown3A8;                      // 0x3A8
    DWORD dwUnknown3AC;                      // 0x3AC
    DWORD dwUnknown3B0;                      // 0x3B0
    DWORD dwUnknown3B4;                      // 0x3B4
    DWORD dwUnknown3B8;                      // 0x3B8
    DWORD dwUnknown3BC;                      // 0x3BC
    DWORD dwUnknown3C0;                      // 0x3C0
    DWORD dwUnknown3C4;                      // 0x3C4
    DWORD dwUnknown3C8;                      // 0x3C8
    DWORD dwUnknown3CC;                      // 0x3CC
    DWORD dwUnknown3D0;                      // 0x3D0
    DWORD dwUnknown3D4;                      // 0x3D4
    DWORD dwUnknown3D8;                      // 0x3D8
    DWORD dwUnknown3DC;                      // 0x3DC
    DWORD dwUnknown3E0;                      // 0x3E0
    DWORD dwUnknown3E4;                      // 0x3E4
    DWORD dwUnknown3E8;                      // 0x3E8
    DWORD dwUnknown3EC;                      // 0x3EC
    DWORD dwUnknown3F0;                      // 0x3F0
    DWORD dwUnknown3F4;                      // 0x3F4
    DWORD dwUnknown3F8;                      // 0x3F8
    DWORD dwUnknown3FC;                      // 0x3FC
    DWORD dwUnknown400;                      // 0x400
    void* pUnknown404;                       // 0x404
    void* pUnknown408;                       // 0x408
    void* pUnknown40C;                       // 0x40C
    DWORD dwUnknown410;                      // 0x410
    DWORD dwUnknown414;                      // 0x414
    DWORD dwUnknown418;                      // 0x418
    DWORD dwUnknown41C;                      // 0x41C
    DWORD dwUnknown420;                      // 0x420
    DWORD dwUnknown424;                      // 0x424
    DWORD dwUnknown428;                      // 0x428
    DWORD dwUnknown42C;                      // 0x42C
    DWORD dwUnknown430;                      // 0x430
    DWORD dwUnknown434;                      // 0x434
    DWORD dwUnknown438;                      // 0x438
    DWORD dwUnknown43C;                      // 0x43C
    DWORD dwUnknown440;                      // 0x440
    DWORD dwUnknown444;                      // 0x444
    DWORD dwUnknown448;                      // 0x448
    DWORD dwUnknown44C;                      // 0x44C
    DWORD dwUnknown450;                      // 0x450
    DWORD dwUnknown454;                      // 0x454
    DWORD dwUnknown458;                      // 0x458
    DWORD dwUnknown45C;                      // 0x45C
    DWORD dwUnknown460;                      // 0x460
    DWORD dwUnknown464;                      // 0x464
    DWORD dwUnknown468;                      // 0x468
    DWORD dwUnknown46C;                      // 0x46C
    DWORD dwUnknown470;                      // 0x470
    DWORD dwUnknown474;                      // 0x474
    DWORD dwUnknown478;                      // 0x478
    DWORD dwUnknown47C;                      // 0x47C
    DWORD dwUnknown480;                      // 0x480
    DWORD dwUnknown484;                      // 0x484
    DWORD dwUnknown488;                      // 0x488
    DWORD dwUnknown48C;                      // 0x48C
    DWORD dwUnknown490;                      // 0x490
    DWORD dwUnknown494;                      // 0x494
    DWORD dwUnknown498;                      // 0x498
    DWORD dwUnknown49C;                      // 0x49C
    DWORD dwUnknown4A0;                      // 0x4A0
    DWORD dwUnknown4A4;                      // 0x4A4
    DWORD dwUnknown4A8;                      // 0x4A8
    DWORD dwUnknown4AC;                      // 0x4AC
    DWORD dwUnknown4B0;                      // 0x4B0
    DWORD dwUnknown4B4;                      // 0x4B4
    DWORD dwUnknown4B8;                      // 0x4B8
    DWORD dwUnknown4BC;                      // 0x4BC
    DWORD dwUnknown4C0;                      // 0x4C0
    DWORD dwUnknown4C4;                      // 0x4C4
    DWORD dwUnknown4C8;                      // 0x4C8
    DWORD dwUnknown4CC;                      // 0x4CC
    DWORD dwUnknown4D0;                      // 0x4D0
    DWORD dwUnknown4D4;                      // 0x4D4
    DWORD dwUnknown4D8;                      // 0x4D8
    DWORD dwUnknown4DC;                      // 0x4DC
    DWORD dwUnknown4E0;                      // 0x4E0
    DWORD dwUnknown4E4;                      // 0x4E4
    DWORD dwUnknown4E8;                      // 0x4E8
    DWORD dwUnknown4EC;                      // 0x4EC
    DWORD dwUnknown4F0;                      // 0x4F0
    DWORD dwUnknown4F4;                      // 0x4F4
    DWORD dwUnknown4F8;                      // 0x4F8
    DWORD dwUnknown4FC;                      // 0x4FC
    DWORD dwUnknown500;                      // 0x500
    DWORD dwUnknown504;                      // 0x504
    DWORD dwUnknown508;                      // 0x508
    DWORD dwUnknown50C;                      // 0x50C
    DWORD dwUnknown510;                      // 0x510
    DWORD dwUnknown514;                      // 0x514
    DWORD dwUnknown518;                      // 0x518
    DWORD dwUnknown51C;                      // 0x51C
    DWORD dwUnknown520;                      // 0x520
    DWORD dwUnknown524;                      // 0x524
    DWORD dwUnknown528;                      // 0x528
    DWORD dwUnknown52C;                      // 0x52C
    DWORD dwUnknown530;                      // 0x530
    DWORD dwUnknown534;                      // 0x534
    DWORD dwUnknown538;                      // 0x538
    DWORD dwUnknown53C;                      // 0x53C
    DWORD dwUnknown540;                      // 0x540
    DWORD dwUnknown544;                      // 0x544
    DWORD dwUnknown548;                      // 0x548
    DWORD dwUnknown54C;                      // 0x54C
    DWORD dwUnknown550;                      // 0x550
    DWORD dwUnknown554;                      // 0x554
    DWORD dwUnknown558;                      // 0x558
    DWORD dwUnknown55C;                      // 0x55C
    DWORD dwUnknown560;                      // 0x560
    DWORD dwUnknown564;                      // 0x564
    DWORD dwUnknown568;                      // 0x568
    DWORD dwUnknown56C;                      // 0x56C
    DWORD dwUnknown570;                      // 0x570
    DWORD dwUnknown574;                      // 0x574
    DWORD dwUnknown578;                      // 0x578
    DWORD dwUnknown57C;                      // 0x57C
    DWORD dwUnknown580;                      // 0x580
    DWORD dwUnknown584;                      // 0x584
    DWORD dwUnknown588;                      // 0x588
    DWORD dwUnknown58C;                      // 0x58C
    DWORD dwUnknown590;                      // 0x590
    DWORD dwUnknown594;                      // 0x594
    DWORD dwUnknown598;                      // 0x598
    DWORD dwUnknown59C;                      // 0x59C
    DWORD dwUnknown5A0;                      // 0x5A0
    DWORD dwUnknown5A4;                      // 0x5A4
    DWORD dwUnknown5A8;                      // 0x5A8
    DWORD dwUnknown5AC;                      // 0x5AC
    DWORD dwUnknown5B0;                      // 0x5B0
    DWORD dwUnknown5B4;                      // 0x5B4
    DWORD dwUnknown5B8;                      // 0x5B8
    DWORD dwUnknown5BC;                      // 0x5BC
    DWORD dwUnknown5C0;                      // 0x5C0
    DWORD dwUnknown5C4;                      // 0x5C4
    DWORD dwUnknown5C8;                      // 0x5C8
    DWORD dwUnknown5CC;                      // 0x5CC
    DWORD dwUnknown5D0;                      // 0x5D0
    DWORD dwUnknown5D4;                      // 0x5D4
    DWORD dwUnknown5D8;                      // 0x5D8
    DWORD dwUnknown5DC;                      // 0x5DC
    DWORD dwUnknown5E0;                      // 0x5E0
    DWORD dwUnknown5E4;                      // 0x5E4
    DWORD dwUnknown5E8;                      // 0x5E8
    DWORD dwUnknown5EC;                      // 0x5EC
    DWORD dwUnknown5F0;                      // 0x5F0
    DWORD dwUnknown5F4;                      // 0x5F4
    DWORD dwUnknown5F8;                      // 0x5F8
    DWORD dwUnknown5FC;                      // 0x5FC
    DWORD dwUnknown600;                      // 0x600
    DWORD dwUnknown604;                      // 0x604
    void* pUnknown608;                       // 0x608
    DWORD dwUnknown60C;                      // 0x60C
    DWORD dwUnknown610;                      // 0x610
    DWORD dwUnknown614;                      // 0x614
    DWORD dwUnknown618;                      // 0x618
    DWORD dwUnknown61C;                      // 0x61C
    DWORD dwUnknown620;                      // 0x620
    DWORD dwUnknown624;                      // 0x624
    DWORD dwUnknown628;                      // 0x628
    DWORD dwUnknown62C;                      // 0x62C
    DWORD dwUnknown630;                      // 0x630
    DWORD dwUnknown634;                      // 0x634
    DWORD dwUnknown638;                      // 0x638
    DWORD dwUnknown63C;                      // 0x63C
    DWORD dwUnknown640;                      // 0x640
    DWORD dwUnknown644;                      // 0x644
    DWORD dwUnknown648;                      // 0x648
    float fUnknown64C;                       // 0x64C
    float fUnknown650;                       // 0x650
    float fUnknown654;                       // 0x654
    void* pUnknown658;                       // 0x658
    void* pUnknown65C;                       // 0x65C
    void* pUnknown660;                       // 0x660
    DWORD dwUnknown664;                      // 0x664
    DWORD dwUnknown668;                      // 0x668
    DWORD dwUnknown66C;                      // 0x66C
    DWORD dwUnknown670;                      // 0x670
    DWORD dwUnknown674;                      // 0x674
    DWORD dwUnknown678;                      // 0x678
    void* pUnknown67C;                       // 0x67C
    void* pUnknown680;                       // 0x680
    void* pUnknown684;                       // 0x684
    void* pUnknown688;                       // 0x688
    void* pUnknown68C;                       // 0x68C
    void* pUnknown690;                       // 0x690
    void* pUnknown694;                       // 0x694
    void* pUnknown698;                       // 0x698
    void* pUnknown69C;                       // 0x69C
    void* pUnknown6A0;                       // 0x6A0
    DWORD dwUnknown6A4;                      // 0x6A4
    DWORD dwUnknown6A8;                      // 0x6A8
    DWORD dwUnknown6AC;                      // 0x6AC
    DWORD dwUnknown6B0;                      // 0x6B0
    DWORD dwUnknown6B4;                      // 0x6B4
    DWORD dwUnknown6B8;                      // 0x6B8
    DWORD dwUnknown6BC;                      // 0x6BC
    DWORD dwUnknown6C0;                      // 0x6C0
    void* pUnknown6C4;                       // 0x6C4
    DWORD dwUnknown6C8;                      // 0x6C8
    DWORD dwUnknown6CC;                      // 0x6CC
    DWORD dwUnknown6D0;                      // 0x6D0
    DWORD dwUnknown6D4;                      // 0x6D4
    DWORD dwUnknown6D8;                      // 0x6D8
    DWORD dwUnknown6DC;                      // 0x6DC
    DWORD dwUnknown6E0;                      // 0x6E0
    DWORD dwUnknown6E4;                      // 0x6E4
    DWORD dwUnknown6E8;                      // 0x6E8
    DWORD dwUnknown6EC;                      // 0x6EC
    DWORD dwUnknown6F0;                      // 0x6F0
    DWORD dwUnknown6F4;                      // 0x6F4
    DWORD dwUnknown6F8;                      // 0x6F8
    DWORD dwUnknown6FC;                      // 0x6FC
    DWORD dwUnknown700;                      // 0x700
    DWORD dwUnknown704;                      // 0x704
    DWORD dwUnknown708;                      // 0x708
    DWORD dwUnknown70C;                      // 0x70C
    DWORD dwUnknown710;                      // 0x710
    DWORD dwUnknown714;                      // 0x714
    void* pUnknown718;                       // 0x718
    DWORD dwUnknown71C;                      // 0x71C
    DWORD dwUnknown720;                      // 0x720
    DWORD dwUnknown724;                      // 0x724
    DWORD dwUnknown728;                      // 0x728
    DWORD dwUnknown72C;                      // 0x72C
    void* pUnknown730;                       // 0x730
    DWORD dwUnknown734;                      // 0x734
    DWORD dwUnknown738;                      // 0x738
    DWORD dwUnknown73C;                      // 0x73C
    DWORD dwUnknown740;                      // 0x740
    DWORD dwUnknown744;                      // 0x744
    void* pUnknown748;                       // 0x748
    DWORD dwUnknown74C;                      // 0x74C
    DWORD dwUnknown750;                      // 0x750
    DWORD dwUnknown754;                      // 0x754
    DWORD dwUnknown758;                      // 0x758
    DWORD dwUnknown75C;                      // 0x75C
    DWORD dwUnknown760;                      // 0x760
    DWORD dwUnknown764;                      // 0x764
    DWORD dwUnknown768;                      // 0x768
    DWORD dwUnknown76C;                      // 0x76C
    DWORD dwUnknown770;                      // 0x770
    DWORD dwUnknown774;                      // 0x774
    DWORD dwUnknown778;                      // 0x778
    DWORD dwUnknown77C;                      // 0x77C
    DWORD dwUnknown780;                      // 0x780
    DWORD dwUnknown784;                      // 0x784
    DWORD dwUnknown788;                      // 0x788
    DWORD dwUnknown78C;                      // 0x78C
    double dUnknown790;                      // 0x790
    DWORD dwUnknown798;                      // 0x798
    DWORD dwUnknown79C;                      // 0x79C
    DWORD dwUnknown7A0;                      // 0x7A0
    DWORD dwUnknown7A4;                      // 0x7A4
    DWORD dwUnknown7A8;                      // 0x7A8
    DWORD dwUnknown7AC;                      // 0x7AC
    DWORD dwUnknown7B0;                      // 0x7B0
    DWORD dwUnknown7B4;                      // 0x7B4
    DWORD dwUnknown7B8;                      // 0x7B8
    DWORD dwUnknown7BC;                      // 0x7BC
    float fUnknown7C0;                       // 0x7C0
    float fUnknown7C4;                       // 0x7C4
    DWORD dwUnknown7C8;                      // 0x7C8
    float fUnknown7CC;                       // 0x7CC
    DWORD dwUnknown7D0;                      // 0x7D0
    DWORD dwUnknown7D4;                      // 0x7D4
    DWORD dwUnknown7D8;                      // 0x7D8
    DWORD dwUnknown7DC;                      // 0x7DC
    DWORD dwUnknown7E0;                      // 0x7E0
    DWORD dwUnknown7E4;                      // 0x7E4
    DWORD dwUnknown7E8;                      // 0x7E8
    DWORD dwUnknown7EC;                      // 0x7EC
    DWORD dwUnknown7F0;                      // 0x7F0
    DWORD dwUnknown7F4;                      // 0x7F4
    void* pUnknown7F8;                       // 0x7F8
    DWORD dwUnknown7FC;                      // 0x7FC
    DWORD dwUnknown800;                      // 0x800
    DWORD dwUnknown804;                      // 0x804
    DWORD dwUnknown808;                      // 0x808
    DWORD dwUnknown80C;                      // 0x80C
    DWORD dwUnknown810;                      // 0x810
    double dUnknown814;                      // 0x814
    float fUnknown81C;                       // 0x81C
    float fUnknown820;                       // 0x820
    double dUnknown824;                      // 0x824
    float fUnknown82C;                       // 0x82C
    float fUnknown830;                       // 0x830
    float fUnknown834;                       // 0x834
    DWORD dwUnknown838;                      // 0x838
    DWORD dwUnknown83C;                      // 0x83C
    DWORD dwUnknown840;                      // 0x840
    DWORD dwGodModeFlag;                     // 0x844 (bit 0x8 = god mode, do ToggleGodMode)
    double dUnknown848;                      // 0x848
    DWORD dwUnknown850;                      // 0x850
    void* pUnknown854;                       // 0x854
    DWORD dwUnknown858;                      // 0x858
    DWORD dwUnknown85C;                      // 0x85C
    DWORD dwUnknown860;                      // 0x860
    float fUnknown864;                       // 0x864
    DWORD dwUnknown868;                      // 0x868
    DWORD dwUnknown86C;                      // 0x86C
    DWORD dwUnknown870;                      // 0x870
    DWORD dwUnknown874;                      // 0x874
    DWORD dwUnknown878;                      // 0x878
    DWORD dwUnknown87C;                      // 0x87C
    DWORD dwUnknown880;                      // 0x880
    void* pUnknown884;                       // 0x884
    double dUnknown888;                      // 0x888
    DWORD dwUnknown890;                      // 0x890
    DWORD dwUnknown894;                      // 0x894
    DWORD dwUnknown898;                      // 0x898
    DWORD dwUnknown89C;                      // 0x89C
    void* pUnknown8A0;                       // 0x8A0
    void* pUnknown8A4;                       // 0x8A4
    void* pUnknown8A8;                       // 0x8A8
    void* pUnknown8AC;                       // 0x8AC
    DWORD dwUnknown8B0;                      // 0x8B0
    DWORD dwUnknown8B4;                      // 0x8B4
    DWORD dwUnknown8B8;                      // 0x8B8
    DWORD dwUnknown8BC;                      // 0x8BC
    double dUnknown8C0;                      // 0x8C0
    DWORD dwUnknown8C8;                      // 0x8C8
    DWORD dwUnknown8CC;                      // 0x8CC
    DWORD dwUnknown8D0;                      // 0x8D0
    DWORD dwUnknown8D4;                      // 0x8D4
    DWORD dwUnknown8D8;                      // 0x8D8
    DWORD dwUnknown8DC;                      // 0x8DC
    DWORD dwUnknown8E0;                      // 0x8E0
    DWORD dwUnknown8E4;                      // 0x8E4
    DWORD dwUnknown8E8;                      // 0x8E8
    DWORD dwUnknown8EC;                      // 0x8EC
    DWORD dwUnknown8F0;                      // 0x8F0
    DWORD dwUnknown8F4;                      // 0x8F4
    DWORD dwUnknown8F8;                      // 0x8F8
    DWORD dwUnknown8FC;                      // 0x8FC
    DWORD dwUnknown900;                      // 0x900
    DWORD dwUnknown904;                      // 0x904
    DWORD dwUnknown908;                      // 0x908
    DWORD dwUnknown90C;                      // 0x90C
    DWORD dwUnknown910;                      // 0x910
    float fUnknown914;                       // 0x914
    DWORD dwUnknown918;                      // 0x918
    DWORD dwUnknown91C;                      // 0x91C
    DWORD dwUnknown920;                      // 0x920
    DWORD dwUnknown924;                      // 0x924
    float fUnknown928;                       // 0x928
    DWORD dwUnknown92C;                      // 0x92C
    DWORD dwUnknown930;                      // 0x930
    DWORD dwUnknown934;                      // 0x934
    DWORD dwUnknown938;                      // 0x938
    DWORD dwUnknown93C;                      // 0x93C
    DWORD dwUnknown940;                      // 0x940
    DWORD dwUnknown944;                      // 0x944
    DWORD dwUnknown948;                      // 0x948
    DWORD dwUnknown94C;                      // 0x94C
    DWORD dwUnknown950;                      // 0x950
    DWORD dwUnknown954;                      // 0x954
    DWORD dwUnknown958;                      // 0x958
    DWORD dwUnknown95C;                      // 0x95C
    DWORD dwUnknown960;                      // 0x960
    DWORD dwUnknown964;                      // 0x964
    DWORD dwUnknown968;                      // 0x968
    DWORD dwUnknown96C;                      // 0x96C
    DWORD dwUnknown970;                      // 0x970
    float fUnknown974;                       // 0x974
    float fUnknown978;                       // 0x978
    float fUnknown97C;                       // 0x97C
    float fUnknown980;                       // 0x980
    DWORD dwUnknown984;                      // 0x984
    DWORD dwUnknown988;                      // 0x988
    double dUnknown98C;                      // 0x98C
    DWORD dwUnknown994;                      // 0x994
    DWORD dwUnknown998;                      // 0x998
    DWORD dwUnknown99C;                      // 0x99C
    DWORD dwUnknown9A0;                      // 0x9A0
    DWORD dwUnknown9A4;                      // 0x9A4
    DWORD dwUnknown9A8;                      // 0x9A8
    DWORD dwUnknown9AC;                      // 0x9AC
    DWORD dwUnknown9B0;                      // 0x9B0
    void* pUnknown9B4;                       // 0x9B4
    void* pUnknown9B8;                       // 0x9B8
    void* pUnknown9BC;                       // 0x9BC
    void* pUnknown9C0;                       // 0x9C0
    void* pUnknown9C4;                       // 0x9C4
    void* pUnknown9C8;                       // 0x9C8
    void* pUnknown9CC;                       // 0x9CC
    DWORD dwUnknown9D0;                      // 0x9D0
    DWORD dwUnknown9D4;                      // 0x9D4
    DWORD dwUnknown9D8;                      // 0x9D8
    DWORD dwUnknown9DC;                      // 0x9DC
    DWORD dwUnknown9E0;                      // 0x9E0
    DWORD dwUnknown9E4;                      // 0x9E4
    DWORD dwUnknown9E8;                      // 0x9E8
    DWORD dwUnknown9EC;                      // 0x9EC
    DWORD dwUnknown9F0;                      // 0x9F0
    DWORD dwUnknown9F4;                      // 0x9F4
    DWORD dwUnknown9F8;                      // 0x9F8
    DWORD dwUnknown9FC;                      // 0x9FC
    DWORD dwUnknownA00;                      // 0xA00
    DWORD dwUnknownA04;                      // 0xA04
    DWORD dwUnknownA08;                      // 0xA08
    DWORD dwUnknownA0C;                      // 0xA0C
    DWORD dwUnknownA10;                      // 0xA10
    void* pUnknownA14;                       // 0xA14
    DWORD dwUnknownA18;                      // 0xA18
    DWORD dwUnknownA1C;                      // 0xA1C
    void* pUnknownA20;                       // 0xA20
    void* pUnknownA24;                       // 0xA24
    void* pUnknownA28;                       // 0xA28
    DWORD dwUnknownA2C;                      // 0xA2C
    void* pUnknownA30;                       // 0xA30
    DWORD dwUnknownA34;                      // 0xA34
    DWORD dwUnknownA38;                      // 0xA38
    DWORD dwUnknownA3C;                      // 0xA3C
    void* pUnknownA40;                       // 0xA40
    void* pUnknownA44;                       // 0xA44
    void* pUnknownA48;                       // 0xA48
    DWORD dwUnknownA4C;                      // 0xA4C
    char unknownA50[7];                      // 0xA50
    unsigned char unknownA57;                // 0xA57
    DWORD dwUnknownA58;                      // 0xA58
    DWORD dwUnknownA5C;                      // 0xA5C
    void* pUnknownA60;                       // 0xA60
    void* pUnknownA64;                       // 0xA64
    void* pUnknownA68;                       // 0xA68
    DWORD dwUnknownA6C;                      // 0xA6C
    void* pUnknownA70;                       // 0xA70
    void* pUnknownA74;                       // 0xA74
    DWORD dwUnknownA78;                      // 0xA78
    void* pUnknownA7C;                       // 0xA7C
    DWORD dwUnknownA80;                      // 0xA80
    void* pUnknownA84;                       // 0xA84
    DWORD dwUnknownA88;                      // 0xA88
    double dUnknownA8C;                      // 0xA8C
    float fUnknownA94;                       // 0xA94
    float fUnknownA98;                       // 0xA98
    DWORD dwUnknownA9C;                      // 0xA9C
    float fUnknownAA0;                       // 0xAA0
    float fUnknownAA4;                       // 0xAA4
    float fUnknownAA8;                       // 0xAA8
    DWORD dwUnknownAAC;                      // 0xAAC
    float fUnknownAB0;                       // 0xAB0
    float fUnknownAB4;                       // 0xAB4
    unsigned char unknownAB8;                // 0xAB8
    unsigned char unknownAB9;                // 0xAB9
    unsigned char unknownABA;                // 0xABA
    unsigned char unknownABB;                // 0xABB
    DWORD dwUnknownABC;                      // 0xABC
    float fUnknownAC0;                       // 0xAC0
    DWORD dwUnknownAC4;                      // 0xAC4
    DWORD dwUnknownAC8;                      // 0xAC8
    double dUnknownACC;                      // 0xACC
    float fUnknownAD4;                       // 0xAD4
    float fUnknownAD8;                       // 0xAD8
    DWORD dwUnknownADC;                      // 0xADC
    float fUnknownAE0;                       // 0xAE0
    float fUnknownAE4;                       // 0xAE4
    float fUnknownAE8;                       // 0xAE8
    DWORD dwUnknownAEC;                      // 0xAEC
    float fUnknownAF0;                       // 0xAF0
    float fUnknownAF4;                       // 0xAF4
    float fUnknownAF8;                       // 0xAF8
    DWORD dwUnknownAFC;                      // 0xAFC
    float fUnknownB00;                       // 0xB00
    float fUnknownB04;                       // 0xB04
    float fUnknownB08;                       // 0xB08
    DWORD dwUnknownB0C;                      // 0xB0C
    void* pUnknownB10;                       // 0xB10
    void* pUnknownB14;                       // 0xB14
    void* pUnknownB18;                       // 0xB18
    DWORD dwUnknownB1C;                      // 0xB1C
    void* pUnknownB20;                       // 0xB20
    DWORD dwUnknownB24;                      // 0xB24
    DWORD dwUnknownB28;                      // 0xB28
    char unknownB2C[13];                     // 0xB2C
    unsigned char unknownB39;                // 0xB39
    unsigned char unknownB3A;                // 0xB3A
    unsigned char unknownB3B;                // 0xB3B
    DWORD dwUnknownB3C;                      // 0xB3C
    DWORD dwUnknownB40;                      // 0xB40
    DWORD dwUnknownB44;                      // 0xB44
    DWORD dwUnknownB48;                      // 0xB48
    DWORD dwUnknownB4C;                      // 0xB4C
    void* pUnknownB50;                       // 0xB50
    DWORD dwUnknownB54;                      // 0xB54
    DWORD dwUnknownB58;                      // 0xB58
    float fUnknownB5C;                       // 0xB5C
    float fUnknownB60;                       // 0xB60
    float fUnknownB64;                       // 0xB64
    double dUnknownB68;                      // 0xB68
    float fUnknownB70;                       // 0xB70
    float fUnknownB74;                       // 0xB74
    double dUnknownB78;                      // 0xB78
    float fUnknownB80;                       // 0xB80
    float fUnknownB84;                       // 0xB84
    DWORD dwUnknownB88;                      // 0xB88
    float fUnknownB8C;                       // 0xB8C
    float fUnknownB90;                       // 0xB90
    float fUnknownB94;                       // 0xB94
    DWORD dwUnknownB98;                      // 0xB98
    float fUnknownB9C;                       // 0xB9C
    float fUnknownBA0;                       // 0xBA0
    float fUnknownBA4;                       // 0xBA4
    double dUnknownBA8;                      // 0xBA8
    float fUnknownBB0;                       // 0xBB0
    float fUnknownBB4;                       // 0xBB4
    double dUnknownBB8;                      // 0xBB8
    float fUnknownBC0;                       // 0xBC0
    float fUnknownBC4;                       // 0xBC4
    DWORD dwUnknownBC8;                      // 0xBC8
    float fUnknownBCC;                       // 0xBCC
    float fUnknownBD0;                       // 0xBD0
    float fUnknownBD4;                       // 0xBD4
    DWORD dwUnknownBD8;                      // 0xBD8
    void* pUnknownBDC;                       // 0xBDC
    void* pUnknownBE0;                       // 0xBE0
    void* pUnknownBE4;                       // 0xBE4
    DWORD dwUnknownBE8;                      // 0xBE8
    void* pUnknownBEC;                       // 0xBEC
    DWORD dwUnknownBF0;                      // 0xBF0
    DWORD dwUnknownBF4;                      // 0xBF4
    char unknownBF8[16];                     // 0xBF8
    DWORD dwUnknownC08;                      // 0xC08
    DWORD dwUnknownC0C;                      // 0xC0C
    DWORD dwUnknownC10;                      // 0xC10
    DWORD dwUnknownC14;                      // 0xC14
    DWORD dwUnknownC18;                      // 0xC18
    void* pUnknownC1C;                       // 0xC1C
    DWORD dwUnknownC20;                      // 0xC20
    double dUnknownC24;                      // 0xC24
    DWORD dwUnknownC2C;                      // 0xC2C
    float fUnknownC30;                       // 0xC30
    DWORD dwUnknownC34;                      // 0xC34
    double dUnknownC38;                      // 0xC38
    DWORD dwUnknownC40;                      // 0xC40
    DWORD dwUnknownC44;                      // 0xC44
    char unknownC48[4];                      // 0xC48
    double dUnknownC4C;                      // 0xC4C
    DWORD dwUnknownC54;                      // 0xC54
    float fUnknownC58;                       // 0xC58
    DWORD dwUnknownC5C;                      // 0xC5C
    DWORD dwUnknownC60;                      // 0xC60
    double dUnknownC64;                      // 0xC64
    float fUnknownC6C;                       // 0xC6C
    float fUnknownC70;                       // 0xC70
    double dUnknownC74;                      // 0xC74
    float fUnknownC7C;                       // 0xC7C
    float fUnknownC80;                       // 0xC80
    DWORD dwUnknownC84;                      // 0xC84
    float fUnknownC88;                       // 0xC88
    float fUnknownC8C;                       // 0xC8C
    float fUnknownC90;                       // 0xC90
    DWORD dwUnknownC94;                      // 0xC94
    float fUnknownC98;                       // 0xC98
    float fUnknownC9C;                       // 0xC9C
    float fUnknownCA0;                       // 0xCA0
    DWORD dwUnknownCA4;                      // 0xCA4
    void* pUnknownCA8;                       // 0xCA8
    void* pUnknownCAC;                       // 0xCAC
    void* pUnknownCB0;                       // 0xCB0
    DWORD dwUnknownCB4;                      // 0xCB4
    void* pUnknownCB8;                       // 0xCB8
    DWORD dwUnknownCBC;                      // 0xCBC
    DWORD dwUnknownCC0;                      // 0xCC0
    char unknownCC4[17];                     // 0xCC4
    unsigned char unknownCD5;                // 0xCD5
    unsigned char unknownCD6;                // 0xCD6
    unsigned char unknownCD7;                // 0xCD7
    DWORD dwUnknownCD8;                      // 0xCD8
    DWORD dwUnknownCDC;                      // 0xCDC
    DWORD dwUnknownCE0;                      // 0xCE0
    DWORD dwUnknownCE4;                      // 0xCE4
    void* pUnknownCE8;                       // 0xCE8
    DWORD dwUnknownCEC;                      // 0xCEC
    double dUnknownCF0;                      // 0xCF0
    DWORD dwUnknownCF8;                      // 0xCF8
    char unknownCFC[4];                      // 0xCFC
    DWORD dwUnknownD00;                      // 0xD00
    double dUnknownD04;                      // 0xD04
    DWORD dwUnknownD0C;                      // 0xD0C
    DWORD dwUnknownD10;                      // 0xD10
    DWORD dwUnknownD14;                      // 0xD14
    double dUnknownD18;                      // 0xD18
    DWORD dwUnknownD20;                      // 0xD20
    float fUnknownD24;                       // 0xD24
    DWORD dwUnknownD28;                      // 0xD28
    DWORD dwUnknownD2C;                      // 0xD2C
    double dUnknownD30;                      // 0xD30
    float fUnknownD38;                       // 0xD38
    float fUnknownD3C;                       // 0xD3C
    double dUnknownD40;                      // 0xD40
    float fUnknownD48;                       // 0xD48
    float fUnknownD4C;                       // 0xD4C
    DWORD dwUnknownD50;                      // 0xD50
    float fUnknownD54;                       // 0xD54
    float fUnknownD58;                       // 0xD58
    float fUnknownD5C;                       // 0xD5C
    DWORD dwUnknownD60;                      // 0xD60
    float fUnknownD64;                       // 0xD64
    float fUnknownD68;                       // 0xD68
    float fUnknownD6C;                       // 0xD6C
    DWORD dwUnknownD70;                      // 0xD70
    void* pUnknownD74;                       // 0xD74
    void* pUnknownD78;                       // 0xD78
    DWORD dwUnknownD7C;                      // 0xD7C
    DWORD dwUnknownD80;                      // 0xD80
    void* pUnknownD84;                       // 0xD84
    DWORD dwUnknownD88;                      // 0xD88
    DWORD dwUnknownD8C;                      // 0xD8C
    char unknownD90[19];                     // 0xD90
    unsigned char unknownDA3;                // 0xDA3
    DWORD dwUnknownDA4;                      // 0xDA4
    DWORD dwUnknownDA8;                      // 0xDA8
    DWORD dwUnknownDAC;                      // 0xDAC
    DWORD dwUnknownDB0;                      // 0xDB0
    void* pUnknownDB4;                       // 0xDB4
    DWORD dwUnknownDB8;                      // 0xDB8
    double dUnknownDBC;                      // 0xDBC
    float fUnknownDC4;                       // 0xDC4
    float fUnknownDC8;                       // 0xDC8
    DWORD dwUnknownDCC;                      // 0xDCC
    float fUnknownDD0;                       // 0xDD0
    float fUnknownDD4;                       // 0xDD4
    float fUnknownDD8;                       // 0xDD8
    double dUnknownDDC;                      // 0xDDC
    float fUnknownDE4;                       // 0xDE4
    float fUnknownDE8;                       // 0xDE8
    DWORD dwUnknownDEC;                      // 0xDEC
    float fUnknownDF0;                       // 0xDF0
    float fUnknownDF4;                       // 0xDF4
    float fUnknownDF8;                       // 0xDF8
    double dUnknownDFC;                      // 0xDFC
    float fUnknownE04;                       // 0xE04
    float fUnknownE08;                       // 0xE08
    DWORD dwUnknownE0C;                      // 0xE0C
    float fUnknownE10;                       // 0xE10
    float fUnknownE14;                       // 0xE14
    float fUnknownE18;                       // 0xE18
    double dUnknownE1C;                      // 0xE1C
    float fUnknownE24;                       // 0xE24
    float fUnknownE28;                       // 0xE28
    DWORD dwUnknownE2C;                      // 0xE2C
    float fUnknownE30;                       // 0xE30
    float fUnknownE34;                       // 0xE34
    float fUnknownE38;                       // 0xE38
    DWORD dwUnknownE3C;                      // 0xE3C
    void* pUnknownE40;                       // 0xE40
    void* pUnknownE44;                       // 0xE44
    void* pUnknownE48;                       // 0xE48
    void* pUnknownE4C;                       // 0xE4C
    void* pUnknownE50;                       // 0xE50
    DWORD dwUnknownE54;                      // 0xE54
    DWORD dwUnknownE58;                      // 0xE58
    char unknownE5C[16];                     // 0xE5C
    DWORD dwUnknownE6C;                      // 0xE6C
    DWORD dwUnknownE70;                      // 0xE70
    DWORD dwUnknownE74;                      // 0xE74
    DWORD dwUnknownE78;                      // 0xE78
    DWORD dwUnknownE7C;                      // 0xE7C
    void* pUnknownE80;                       // 0xE80
    DWORD dwUnknownE84;                      // 0xE84
    double dUnknownE88;                      // 0xE88
    DWORD dwUnknownE90;                      // 0xE90
    float fUnknownE94;                       // 0xE94
    DWORD dwUnknownE98;                      // 0xE98
    double dUnknownE9C;                      // 0xE9C
    DWORD dwUnknownEA4;                      // 0xEA4
    DWORD dwUnknownEA8;                      // 0xEA8
    float fUnknownEAC;                       // 0xEAC
    double dUnknownEB0;                      // 0xEB0
    DWORD dwUnknownEB8;                      // 0xEB8
    char unknownEBC[4];                      // 0xEBC
    DWORD dwUnknownEC0;                      // 0xEC0
    DWORD dwUnknownEC4;                      // 0xEC4
    DWORD dwUnknownEC8;                      // 0xEC8
    float fUnknownECC;                       // 0xECC
    float fUnknownED0;                       // 0xED0
    float fUnknownED4;                       // 0xED4
    DWORD dwUnknownED8;                      // 0xED8
    float fUnknownEDC;                       // 0xEDC
    float fUnknownEE0;                       // 0xEE0
    float fUnknownEE4;                       // 0xEE4
    double dUnknownEE8;                      // 0xEE8
    float fUnknownEF0;                       // 0xEF0
    float fUnknownEF4;                       // 0xEF4
    DWORD dwUnknownEF8;                      // 0xEF8
    float fUnknownEFC;                       // 0xEFC
    float fUnknownF00;                       // 0xF00
    float fUnknownF04;                       // 0xF04
    DWORD dwUnknownF08;                      // 0xF08
    void* pUnknownF0C;                       // 0xF0C
    void* pUnknownF10;                       // 0xF10
    void* pUnknownF14;                       // 0xF14
    DWORD dwUnknownF18;                      // 0xF18
    void* pUnknownF1C;                       // 0xF1C
    DWORD dwUnknownF20;                      // 0xF20
    DWORD dwUnknownF24;                      // 0xF24
    char unknownF28[17];                     // 0xF28
    unsigned char unknownF39;                // 0xF39
    unsigned char unknownF3A;                // 0xF3A
    unsigned char unknownF3B;                // 0xF3B
    DWORD dwUnknownF3C;                      // 0xF3C
    DWORD dwUnknownF40;                      // 0xF40
    DWORD dwUnknownF44;                      // 0xF44
    DWORD dwUnknownF48;                      // 0xF48
    void* pUnknownF4C;                       // 0xF4C
    DWORD dwUnknownF50;                      // 0xF50
    double dUnknownF54;                      // 0xF54
    DWORD dwUnknownF5C;                      // 0xF5C
    DWORD dwUnknownF60;                      // 0xF60
    DWORD dwUnknownF64;                      // 0xF64
    unsigned char unknownF68;                // 0xF68
    unsigned char unknownF69;                // 0xF69
    unsigned char unknownF6A;                // 0xF6A
    unsigned char unknownF6B;                // 0xF6B
    float fUnknownF6C;                       // 0xF6C
    DWORD dwUnknownF70;                      // 0xF70
    DWORD dwUnknownF74;                      // 0xF74
    DWORD dwUnknownF78;                      // 0xF78
    double dUnknownF7C;                      // 0xF7C
    DWORD dwUnknownF84;                      // 0xF84
    char unknownF88[4];                      // 0xF88
    DWORD dwUnknownF8C;                      // 0xF8C
    DWORD dwUnknownF90;                      // 0xF90
    DWORD dwUnknownF94;                      // 0xF94
    float fUnknownF98;                       // 0xF98
    float fUnknownF9C;                       // 0xF9C
    float fUnknownFA0;                       // 0xFA0
    DWORD dwUnknownFA4;                      // 0xFA4
    float fUnknownFA8;                       // 0xFA8
    float fUnknownFAC;                       // 0xFAC
    float fUnknownFB0;                       // 0xFB0
    double dUnknownFB4;                      // 0xFB4
    float fUnknownFBC;                       // 0xFBC
    float fUnknownFC0;                       // 0xFC0
    DWORD dwUnknownFC4;                      // 0xFC4
    float fUnknownFC8;                       // 0xFC8
    float fUnknownFCC;                       // 0xFCC
    float fUnknownFD0;                       // 0xFD0
    DWORD dwUnknownFD4;                      // 0xFD4
    void* pUnknownFD8;                       // 0xFD8
    void* pUnknownFDC;                       // 0xFDC
    DWORD dwUnknownFE0;                      // 0xFE0
    DWORD dwUnknownFE4;                      // 0xFE4
    void* pUnknownFE8;                       // 0xFE8
    DWORD dwUnknownFEC;                      // 0xFEC
    DWORD dwUnknownFF0;                      // 0xFF0
    char unknownFF4[12];                     // 0xFF4
};

#pragma pack(pop)

namespace CPlayer
{
	PLAYER_STATE GetPlayerState();
	void SetPlayerCameraMode(CAMERA_MODE mode);
	CAMERA_MODE GetPlayerCameraMode();

    void SetPlayerFogColor(DWORD color);
	DWORD GetPlayerFogColor();

	void TogglePlayerHud(bool toggle);
	bool IsPlayerHudEnabled();
 
    void SetMenu(int menu);
    void AccumulateTime();

    Player* GetPlayer();
    int GetPlayerBase();

    void InstallHook();
}

